Revit 2027 API
ExtrusionAnalyzer.ExtrusionDirection Property
 The direction of extrusion specified for the extrusion analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ExtrusionDirection { get; }
Public ReadOnly Property ExtrusionDirection As XYZ
	Get
public:
property XYZ^ ExtrusionDirection {
	XYZ^ get ();
}
member ExtrusionDirection : XYZ with get
Property Value
XYZ
See Also
Reference
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace